cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "mas-cli/tap"

# TODO put all the brew things here, can 'brew list' to see
brew 'git'
brew 'gh'
brew 'mas'
brew 'jq'
brew 'zsh-syntax-highlighting'
brew 'go'
brew 'golangci-lint'
brew 'nvm'
brew 'awscli'
brew 'bat'
brew 'fx'
brew 'nvm'

cask '1password'
cask 'slack'
cask 'intellij-idea'
cask 'datagrip'
cask 'sequel-pro'
cask 'docker'
cask 'viscosity'
cask 'postman'
cask 'visual-studio-code'
cask 'skitch'
cask 'google-chrome'
cask 'dropbox'
cask 'firefox'
cask 'spotify'
cask 'caffeine'
cask 'flux'
cask 'zsa-wally'
cask 'bettertouchtool'
cask 'bartender'
cask 'obsidian'
