cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "mas-cli/tap"

# TODO put all the brew things here, can 'brew list' to see
brew 'git'
brew 'gh'
brew 'nvm'
brew 'mas'
brew 'jq'
brew 'zsh-syntax-highlighting'

cask 'slack'
cask 'intellij-idea'
cask 'github'
cask 'sequel-pro'
cask 'docker'
cask 'viscosity'
cask 'postman'
cask 'visual-studio-code'
cask 'skitch'
cask 'google-chrome'
cask 'dropbox'
cask 'firefox'
cask 'spotify'
cask 'vlc'
cask 'caffeine'
cast 'flux'
# Install 1password manually.
