cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "mas-cli/tap"

# TODO put all the brew things here, can 'brew list' to see
brew 'git'
brew 'hub' # don't forget to alias this
brew 'node'
brew 'mas'

cask 'slack'
cask 'intellij-idea'
cask 'github'
cask 'sequel-pro'
cask 'docker'
cask 'viscosity'
cask 'virtualbox'
cask 'vagrant'
cask 'postman'
cask 'visual-studio-code'
cask 'skitch'
cask 'beardedspice'
cask 'google-chrome'
cask 'dropbox'
cask 'firefox'
cask 'spotify'
cask 'vlc'
cask 'caffeine'
# Install 1password manually.
